app/controllers/user_controller_controller.rb

INSERT INTO "users" ("name", "bio") VALUES (?, ?)  [["name", "Mosieur patate"], ["bio", ""]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def create
  	@user = User.create name: params[:name], bio: params[:bio]
  	if @user.save
	redirect_to "/user/#{User.last.name}"

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "jhhjghgh"], ["LIMIT", 1]]
---
  def show
  	@user = User.find_by(name: params[:name])